content/blog/fuck-more-face-detection.md
+++
title = "你的密码写在脸上"
author = ["Evilee"]
date = 2020-01-09
lastmod = 2020-01-09T17:19:05+08:00
tags = ["gfw"]
categories = ["计算机"]
draft = false
creator = "Emacs 26.3 (Org mode 9.3 + ox-hugo)"
authorbox = true
comments = true
toc = false
mathjax = true
+++

使用人脸识别的 app 非蠢即坏 － 关于人脸识别的安全隐患。
<!--more-->

曾经，在互联网发展的初期，几乎每个网民都受到过初步的网络安全的知识科普。网络安全知识第一条：\*不要在不同的网站使用同一套密码\*。不同网站使用同一套密码有什么安全问题呢？听我慢慢道来。

1.  假如你在各个网站使用同一套密码，那几乎就是不设防。比如你在某网站 A 上有一个金融帐号，作为犯罪分子的我，如何才能把你的钱弄到我的钱包里呢？太简单了，我可以做一个网站 B, 吸引你来注册，假如你用同一套用户名和密码，那我就知道了你在 A 网站上的用户名和密码，直接登录就可以随便花你的钱了。
2.  也许你会说，怎么可能这么巧，我能在你开发的 B 网站上注册帐号。那我告诉你，互联网发生过 N 次大型网站密码库被拖库的事件了，而且据谣言传说这些网站都收到过相关部门的照顾，要求必须使用明文存储密码（为啥要明文？参考第一条）。
3.  也许你会说，我是良民，相关部门不会对我做什么。你这么说也非常有道理。但是架不住流行网站 C 的技术太差，被黑客拖库啊。那你的 A 信息就到了黑客手里。
4.  也许你会说，C 网站那么有钱，他们开发的系统没有漏洞，黑客没法攻破。须知日防夜防家贼难防，堡垒最容易从内部攻破。互联网发展史几十年，不知道有多少公司员工被送进了看守所。
5.  党一大代表周佛海都当了叛徒，所以人永远是最大的安全隐患，相关部门也无法避免每个党员都恪守党规，遵纪守法，18 big 以来打的老虎可都是在党旗下宣过誓的。

现在大家知道同一套密码的危害了吧？互联网发展到今天，众多 APP 居然开启了人脸识别认证，这不能不让人怀疑难道是又有相关部门照顾，要求收集人脸数据了？相对于密码，人脸信息更加不安全。

1.  密码泄漏了，你可以换一个，人脸信息泄漏了，你去整容？
2.  不同的网站可以使用不同的密码，不同的网站能用不同的脸吗？你有几张脸？
3.  密码只有你自己知道，但是人脸大家都能看到，相当于你把密码挂在了脸上。
4.  也许你会说，除了密码外，还有肢体识别呢。别逗了您，知道 deepfake 吗？你可以去
    pxxnhub 上去看看，只要有照片，就可以把脸贴上去。还有 crazytalk 软件，直接根据某张照片做出眨眼，摇头，傻乐等各种动作表情，怎么样？
5.  蓬勃发展的过脸黑产已经说明了一切。

所以，强制开启人脸识别的 APP 非蠢即坏。

1.  追新，使用花拳绣腿的功能而不考虑安全后果，这是蠢。
2.  趁着中国个人隐私立法的缺失，搜集用户的人脸数据，将来怎么用凭自己心情，这是坏。
